node {
  name: "Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 224
        }
        dim {
          size: 224
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "Placeholder_1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 7
        }
      }
    }
  }
}
node {
  name: "Placeholder_2"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "conv1/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\007\000\000\000\007\000\000\000\003\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "conv1/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.04275039955973625
      }
    }
  }
}
node {
  name: "conv1/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.04275039955973625
      }
    }
  }
}
node {
  name: "conv1/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "conv1/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "conv1/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "conv1/kernel/Initializer/random_uniform/max"
  input: "conv1/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1/kernel"
      }
    }
  }
}
node {
  name: "conv1/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "conv1/kernel/Initializer/random_uniform/RandomUniform"
  input: "conv1/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1/kernel"
      }
    }
  }
}
node {
  name: "conv1/kernel/Initializer/random_uniform"
  op: "Add"
  input: "conv1/kernel/Initializer/random_uniform/mul"
  input: "conv1/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1/kernel"
      }
    }
  }
}
node {
  name: "conv1/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 7
        }
        dim {
          size: 7
        }
        dim {
          size: 3
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv1/kernel/Assign"
  op: "Assign"
  input: "conv1/kernel"
  input: "conv1/kernel/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv1/kernel/read"
  op: "Identity"
  input: "conv1/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1/kernel"
      }
    }
  }
}
node {
  name: "conv1/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "conv1/bias"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1/bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv1/bias/Assign"
  op: "Assign"
  input: "conv1/bias"
  input: "conv1/bias/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv1/bias/read"
  op: "Identity"
  input: "conv1/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1/bias"
      }
    }
  }
}
node {
  name: "conv1/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "conv1/Conv2D"
  op: "Conv2D"
  input: "Placeholder"
  input: "conv1/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "conv1/BiasAdd"
  op: "BiasAdd"
  input: "conv1/Conv2D"
  input: "conv1/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "bn_conv1/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "bn_conv1/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "bn_conv1/gamma/Assign"
  op: "Assign"
  input: "bn_conv1/gamma"
  input: "bn_conv1/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "bn_conv1/gamma/read"
  op: "Identity"
  input: "bn_conv1/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/gamma"
      }
    }
  }
}
node {
  name: "bn_conv1/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "bn_conv1/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "bn_conv1/beta/Assign"
  op: "Assign"
  input: "bn_conv1/beta"
  input: "bn_conv1/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "bn_conv1/beta/read"
  op: "Identity"
  input: "bn_conv1/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/beta"
      }
    }
  }
}
node {
  name: "bn_conv1/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "bn_conv1/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "bn_conv1/moving_mean/Assign"
  op: "Assign"
  input: "bn_conv1/moving_mean"
  input: "bn_conv1/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "bn_conv1/moving_mean/read"
  op: "Identity"
  input: "bn_conv1/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/moving_mean"
      }
    }
  }
}
node {
  name: "bn_conv1/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "bn_conv1/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "bn_conv1/moving_variance/Assign"
  op: "Assign"
  input: "bn_conv1/moving_variance"
  input: "bn_conv1/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "bn_conv1/moving_variance/read"
  op: "Identity"
  input: "bn_conv1/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/moving_variance"
      }
    }
  }
}
node {
  name: "bn_conv1/cond/Switch"
  op: "Switch"
  input: "Placeholder_2"
  input: "Placeholder_2"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "bn_conv1/cond/switch_t"
  op: "Identity"
  input: "bn_conv1/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "bn_conv1/cond/switch_f"
  op: "Identity"
  input: "bn_conv1/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "bn_conv1/cond/pred_id"
  op: "Identity"
  input: "Placeholder_2"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "bn_conv1/cond/Const"
  op: "Const"
  input: "^bn_conv1/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "bn_conv1/cond/Const_1"
  op: "Const"
  input: "^bn_conv1/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "bn_conv1/cond/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "bn_conv1/cond/FusedBatchNormV3/Switch:1"
  input: "bn_conv1/cond/FusedBatchNormV3/Switch_1:1"
  input: "bn_conv1/cond/FusedBatchNormV3/Switch_2:1"
  input: "bn_conv1/cond/Const"
  input: "bn_conv1/cond/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "bn_conv1/cond/FusedBatchNormV3/Switch"
  op: "Switch"
  input: "conv1/BiasAdd"
  input: "bn_conv1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1/BiasAdd"
      }
    }
  }
}
node {
  name: "bn_conv1/cond/FusedBatchNormV3/Switch_1"
  op: "Switch"
  input: "bn_conv1/gamma/read"
  input: "bn_conv1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/gamma"
      }
    }
  }
}
node {
  name: "bn_conv1/cond/FusedBatchNormV3/Switch_2"
  op: "Switch"
  input: "bn_conv1/beta/read"
  input: "bn_conv1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/beta"
      }
    }
  }
}
node {
  name: "bn_conv1/cond/FusedBatchNormV3_1"
  op: "FusedBatchNormV3"
  input: "bn_conv1/cond/FusedBatchNormV3_1/Switch"
  input: "bn_conv1/cond/FusedBatchNormV3_1/Switch_1"
  input: "bn_conv1/cond/FusedBatchNormV3_1/Switch_2"
  input: "bn_conv1/cond/FusedBatchNormV3_1/Switch_3"
  input: "bn_conv1/cond/FusedBatchNormV3_1/Switch_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "bn_conv1/cond/FusedBatchNormV3_1/Switch"
  op: "Switch"
  input: "conv1/BiasAdd"
  input: "bn_conv1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv1/BiasAdd"
      }
    }
  }
}
node {
  name: "bn_conv1/cond/FusedBatchNormV3_1/Switch_1"
  op: "Switch"
  input: "bn_conv1/gamma/read"
  input: "bn_conv1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/gamma"
      }
    }
  }
}
node {
  name: "bn_conv1/cond/FusedBatchNormV3_1/Switch_2"
  op: "Switch"
  input: "bn_conv1/beta/read"
  input: "bn_conv1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/beta"
      }
    }
  }
}
node {
  name: "bn_conv1/cond/FusedBatchNormV3_1/Switch_3"
  op: "Switch"
  input: "bn_conv1/moving_mean/read"
  input: "bn_conv1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/moving_mean"
      }
    }
  }
}
node {
  name: "bn_conv1/cond/FusedBatchNormV3_1/Switch_4"
  op: "Switch"
  input: "bn_conv1/moving_variance/read"
  input: "bn_conv1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/moving_variance"
      }
    }
  }
}
node {
  name: "bn_conv1/cond/Merge"
  op: "Merge"
  input: "bn_conv1/cond/FusedBatchNormV3_1"
  input: "bn_conv1/cond/FusedBatchNormV3"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_conv1/cond/Merge_1"
  op: "Merge"
  input: "bn_conv1/cond/FusedBatchNormV3_1:1"
  input: "bn_conv1/cond/FusedBatchNormV3:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_conv1/cond/Merge_2"
  op: "Merge"
  input: "bn_conv1/cond/FusedBatchNormV3_1:2"
  input: "bn_conv1/cond/FusedBatchNormV3:2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_conv1/cond_1/Switch"
  op: "Switch"
  input: "Placeholder_2"
  input: "Placeholder_2"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "bn_conv1/cond_1/switch_t"
  op: "Identity"
  input: "bn_conv1/cond_1/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "bn_conv1/cond_1/switch_f"
  op: "Identity"
  input: "bn_conv1/cond_1/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "bn_conv1/cond_1/pred_id"
  op: "Identity"
  input: "Placeholder_2"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "bn_conv1/cond_1/Const"
  op: "Const"
  input: "^bn_conv1/cond_1/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.9900000095367432
      }
    }
  }
}
node {
  name: "bn_conv1/cond_1/Const_1"
  op: "Const"
  input: "^bn_conv1/cond_1/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "bn_conv1/cond_1/Merge"
  op: "Merge"
  input: "bn_conv1/cond_1/Const_1"
  input: "bn_conv1/cond_1/Const"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_conv1/AssignMovingAvg/sub/x"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "bn_conv1/AssignMovingAvg/sub"
  op: "Sub"
  input: "bn_conv1/AssignMovingAvg/sub/x"
  input: "bn_conv1/cond_1/Merge"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/moving_mean"
      }
    }
  }
}
node {
  name: "bn_conv1/AssignMovingAvg/sub_1"
  op: "Sub"
  input: "bn_conv1/moving_mean/read"
  input: "bn_conv1/cond/Merge_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/moving_mean"
      }
    }
  }
}
node {
  name: "bn_conv1/AssignMovingAvg/mul"
  op: "Mul"
  input: "bn_conv1/AssignMovingAvg/sub_1"
  input: "bn_conv1/AssignMovingAvg/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/moving_mean"
      }
    }
  }
}
node {
  name: "bn_conv1/AssignMovingAvg"
  op: "AssignSub"
  input: "bn_conv1/moving_mean"
  input: "bn_conv1/AssignMovingAvg/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "bn_conv1/AssignMovingAvg_1/sub/x"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "bn_conv1/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "bn_conv1/AssignMovingAvg_1/sub/x"
  input: "bn_conv1/cond_1/Merge"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/moving_variance"
      }
    }
  }
}
node {
  name: "bn_conv1/AssignMovingAvg_1/sub_1"
  op: "Sub"
  input: "bn_conv1/moving_variance/read"
  input: "bn_conv1/cond/Merge_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/moving_variance"
      }
    }
  }
}
node {
  name: "bn_conv1/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "bn_conv1/AssignMovingAvg_1/sub_1"
  input: "bn_conv1/AssignMovingAvg_1/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/moving_variance"
      }
    }
  }
}
node {
  name: "bn_conv1/AssignMovingAvg_1"
  op: "AssignSub"
  input: "bn_conv1/moving_variance"
  input: "bn_conv1/AssignMovingAvg_1/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_conv1/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "Relu"
  op: "Relu"
  input: "bn_conv1/cond/Merge"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "max_pooling2d/MaxPool"
  op: "MaxPool"
  input: "Relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "res2a_branch2b/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res2a_branch2b/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000@\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "res2a_branch2b/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res2a_branch2b/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.07216878235340118
      }
    }
  }
}
node {
  name: "res2a_branch2b/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res2a_branch2b/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.07216878235340118
      }
    }
  }
}
node {
  name: "res2a_branch2b/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "res2a_branch2b/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res2a_branch2b/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "res2a_branch2b/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "res2a_branch2b/kernel/Initializer/random_uniform/max"
  input: "res2a_branch2b/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res2a_branch2b/kernel"
      }
    }
  }
}
node {
  name: "res2a_branch2b/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "res2a_branch2b/kernel/Initializer/random_uniform/RandomUniform"
  input: "res2a_branch2b/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res2a_branch2b/kernel"
      }
    }
  }
}
node {
  name: "res2a_branch2b/kernel/Initializer/random_uniform"
  op: "Add"
  input: "res2a_branch2b/kernel/Initializer/random_uniform/mul"
  input: "res2a_branch2b/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res2a_branch2b/kernel"
      }
    }
  }
}
node {
  name: "res2a_branch2b/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res2a_branch2b/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 64
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "res2a_branch2b/kernel/Assign"
  op: "Assign"
  input: "res2a_branch2b/kernel"
  input: "res2a_branch2b/kernel/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res2a_branch2b/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "res2a_branch2b/kernel/read"
  op: "Identity"
  input: "res2a_branch2b/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res2a_branch2b/kernel"
      }
    }
  }
}
node {
  name: "id_block_stage2/res2a_branch2b/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0005000000237487257
      }
    }
  }
}
node {
  name: "id_block_stage2/res2a_branch2b/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "res2a_branch2b/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "id_block_stage2/res2a_branch2b/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "id_block_stage2/res2a_branch2b/kernel/Regularizer/l2_regularizer/scale"
  input: "id_block_stage2/res2a_branch2b/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "res2a_branch2b/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res2a_branch2b/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "res2a_branch2b/bias"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res2a_branch2b/bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "res2a_branch2b/bias/Assign"
  op: "Assign"
  input: "res2a_branch2b/bias"
  input: "res2a_branch2b/bias/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res2a_branch2b/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "res2a_branch2b/bias/read"
  op: "Identity"
  input: "res2a_branch2b/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@res2a_branch2b/bias"
      }
    }
  }
}
node {
  name: "id_block_stage2/res2a_branch2b/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "id_block_stage2/res2a_branch2b/Conv2D"
  op: "Conv2D"
  input: "max_pooling2d/MaxPool"
  input: "res2a_branch2b/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "id_block_stage2/res2a_branch2b/BiasAdd"
  op: "BiasAdd"
  input: "id_block_stage2/res2a_branch2b/Conv2D"
  input: "res2a_branch2b/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "bn2a_branch2b/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "bn2a_branch2b/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "bn2a_branch2b/gamma/Assign"
  op: "Assign"
  input: "bn2a_branch2b/gamma"
  input: "bn2a_branch2b/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "bn2a_branch2b/gamma/read"
  op: "Identity"
  input: "bn2a_branch2b/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/gamma"
      }
    }
  }
}
node {
  name: "bn2a_branch2b/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "bn2a_branch2b/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "bn2a_branch2b/beta/Assign"
  op: "Assign"
  input: "bn2a_branch2b/beta"
  input: "bn2a_branch2b/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "bn2a_branch2b/beta/read"
  op: "Identity"
  input: "bn2a_branch2b/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/beta"
      }
    }
  }
}
node {
  name: "bn2a_branch2b/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "bn2a_branch2b/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "bn2a_branch2b/moving_mean/Assign"
  op: "Assign"
  input: "bn2a_branch2b/moving_mean"
  input: "bn2a_branch2b/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "bn2a_branch2b/moving_mean/read"
  op: "Identity"
  input: "bn2a_branch2b/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/moving_mean"
      }
    }
  }
}
node {
  name: "bn2a_branch2b/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "bn2a_branch2b/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "bn2a_branch2b/moving_variance/Assign"
  op: "Assign"
  input: "bn2a_branch2b/moving_variance"
  input: "bn2a_branch2b/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "bn2a_branch2b/moving_variance/read"
  op: "Identity"
  input: "bn2a_branch2b/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/moving_variance"
      }
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond/Switch"
  op: "Switch"
  input: "Placeholder_2"
  input: "Placeholder_2"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond/switch_t"
  op: "Identity"
  input: "id_block_stage2/bn2a_branch2b/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond/switch_f"
  op: "Identity"
  input: "id_block_stage2/bn2a_branch2b/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond/pred_id"
  op: "Identity"
  input: "Placeholder_2"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond/Const"
  op: "Const"
  input: "^id_block_stage2/bn2a_branch2b/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond/Const_1"
  op: "Const"
  input: "^id_block_stage2/bn2a_branch2b/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3/Switch:1"
  input: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3/Switch_1:1"
  input: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3/Switch_2:1"
  input: "id_block_stage2/bn2a_branch2b/cond/Const"
  input: "id_block_stage2/bn2a_branch2b/cond/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3/Switch"
  op: "Switch"
  input: "id_block_stage2/res2a_branch2b/BiasAdd"
  input: "id_block_stage2/bn2a_branch2b/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@id_block_stage2/res2a_branch2b/BiasAdd"
      }
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3/Switch_1"
  op: "Switch"
  input: "bn2a_branch2b/gamma/read"
  input: "id_block_stage2/bn2a_branch2b/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/gamma"
      }
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3/Switch_2"
  op: "Switch"
  input: "bn2a_branch2b/beta/read"
  input: "id_block_stage2/bn2a_branch2b/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/beta"
      }
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3_1"
  op: "FusedBatchNormV3"
  input: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3_1/Switch"
  input: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3_1/Switch_1"
  input: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3_1/Switch_2"
  input: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3_1/Switch_3"
  input: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3_1/Switch_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3_1/Switch"
  op: "Switch"
  input: "id_block_stage2/res2a_branch2b/BiasAdd"
  input: "id_block_stage2/bn2a_branch2b/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@id_block_stage2/res2a_branch2b/BiasAdd"
      }
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3_1/Switch_1"
  op: "Switch"
  input: "bn2a_branch2b/gamma/read"
  input: "id_block_stage2/bn2a_branch2b/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/gamma"
      }
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3_1/Switch_2"
  op: "Switch"
  input: "bn2a_branch2b/beta/read"
  input: "id_block_stage2/bn2a_branch2b/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/beta"
      }
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3_1/Switch_3"
  op: "Switch"
  input: "bn2a_branch2b/moving_mean/read"
  input: "id_block_stage2/bn2a_branch2b/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/moving_mean"
      }
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3_1/Switch_4"
  op: "Switch"
  input: "bn2a_branch2b/moving_variance/read"
  input: "id_block_stage2/bn2a_branch2b/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/moving_variance"
      }
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond/Merge"
  op: "Merge"
  input: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3_1"
  input: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond/Merge_1"
  op: "Merge"
  input: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3_1:1"
  input: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond/Merge_2"
  op: "Merge"
  input: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3_1:2"
  input: "id_block_stage2/bn2a_branch2b/cond/FusedBatchNormV3:2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond_1/Switch"
  op: "Switch"
  input: "Placeholder_2"
  input: "Placeholder_2"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond_1/switch_t"
  op: "Identity"
  input: "id_block_stage2/bn2a_branch2b/cond_1/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond_1/switch_f"
  op: "Identity"
  input: "id_block_stage2/bn2a_branch2b/cond_1/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond_1/pred_id"
  op: "Identity"
  input: "Placeholder_2"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond_1/Const"
  op: "Const"
  input: "^id_block_stage2/bn2a_branch2b/cond_1/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.9900000095367432
      }
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond_1/Const_1"
  op: "Const"
  input: "^id_block_stage2/bn2a_branch2b/cond_1/switch_f"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/cond_1/Merge"
  op: "Merge"
  input: "id_block_stage2/bn2a_branch2b/cond_1/Const_1"
  input: "id_block_stage2/bn2a_branch2b/cond_1/Const"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "id_block_stage2/bn2a_branch2b/AssignMovingAvg/sub/x"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn2a_branch2b/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
